; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-17)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city1)
	(fuel-level plane1 fl0)
	(at plane2 city9)
	(fuel-level plane2 fl4)
	(at plane3 city7)
	(fuel-level plane3 fl6)
	(at person1 city9)
	(at person2 city7)
	(at person3 city11)
	(at person4 city8)
	(at person5 city1)
	(at person6 city10)
	(at person7 city0)
	(at person8 city9)
	(at person9 city4)
	(at person10 city9)
	(at person11 city0)
	(at person12 city4)
	(at person13 city8)
	(at person14 city7)
	(at person15 city9)
	(at person16 city10)
	(at person17 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at person1 city3)
	(at person2 city2)
	(at person3 city8)
	(at person4 city10)
	(at person5 city11)
	(at person6 city11)
	(at person7 city7)
	(at person8 city5)
	(at person9 city1)
	(at person10 city7)
	(at person11 city3)
	(at person13 city10)
	(at person14 city5)
	(at person15 city7)
	(at person16 city4)
	(at person17 city4)
	))

)

; plan
1. (board person2 plane3 city7)
   deleted: (at person2 city7)
   added: (in person2 plane3)
   goals met: 0 of 17
2. (board person14 plane3 city7)
   deleted: (at person14 city7)
   added: (in person14 plane3)
   goals met: 0 of 17
3. (zoom plane3 city7 city2 fl6 fl5 fl4)
   deleted: (at plane3 city7) (fuel-level plane3 fl6)
   added: (at plane3 city2) (fuel-level plane3 fl4)
   goals met: 0 of 17
4. (debark person2 plane3 city2)
   deleted: (in person2 plane3)
   added: (at person2 city2)
   goals met: 1 of 17
5. (zoom plane3 city2 city5 fl4 fl3 fl2)
   deleted: (at plane3 city2) (fuel-level plane3 fl4)
   added: (at plane3 city5) (fuel-level plane3 fl2)
   goals met: 1 of 17
6. (debark person14 plane3 city5)
   deleted: (in person14 plane3)
   added: (at person14 city5)
   goals met: 2 of 17
7. (board person8 plane2 city9)
   deleted: (at person8 city9)
   added: (in person8 plane2)
   goals met: 2 of 17
8. (board person15 plane2 city9)
   deleted: (at person15 city9)
   added: (in person15 plane2)
   goals met: 2 of 17
9. (board person10 plane2 city9)
   deleted: (at person10 city9)
   added: (in person10 plane2)
   goals met: 2 of 17
10. (zoom plane2 city9 city0 fl4 fl3 fl2)
   deleted: (at plane2 city9) (fuel-level plane2 fl4)
   added: (at plane2 city0) (fuel-level plane2 fl2)
   goals met: 2 of 17
11. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   goals met: 2 of 17
12. (board person11 plane2 city0)
   deleted: (at person11 city0)
   added: (in person11 plane2)
   goals met: 2 of 17
13. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   goals met: 2 of 17
14. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 17
15. (board person17 plane1 city1)
   deleted: (at person17 city1)
   added: (in person17 plane1)
   goals met: 2 of 17
16. (zoom plane2 city0 city7 fl2 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl2)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 2 of 17
17. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 17
18. (debark person7 plane2 city7)
   deleted: (in person7 plane2)
   added: (at person7 city7)
   goals met: 3 of 17
19. (debark person15 plane2 city7)
   deleted: (in person15 plane2)
   added: (at person15 city7)
   goals met: 4 of 17
20. (debark person10 plane2 city7)
   deleted: (in person10 plane2)
   added: (at person10 city7)
   goals met: 5 of 17
21. (fly plane1 city1 city11 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 5 of 17
22. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 17
23. (debark person5 plane1 city11)
   deleted: (in person5 plane1)
   added: (at person5 city11)
   goals met: 6 of 17
24. (board person3 plane1 city11)
   deleted: (at person3 city11)
   added: (in person3 plane1)
   goals met: 6 of 17
25. (fly plane1 city11 city4 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 6 of 17
26. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 17
27. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   goals met: 6 of 17
28. (debark person17 plane1 city4)
   deleted: (in person17 plane1)
   added: (at person17 city4)
   goals met: 7 of 17
29. (fly plane1 city4 city1 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 7 of 17
30. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 17
31. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   goals met: 8 of 17
32. (fly plane1 city1 city8 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 8 of 17
33. (board person4 plane1 city8)
   deleted: (at person4 city8)
   added: (in person4 plane1)
   goals met: 8 of 17
34. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 17
35. (debark person3 plane1 city8)
   deleted: (in person3 plane1)
   added: (at person3 city8)
   goals met: 9 of 17
36. (board person13 plane1 city8)
   deleted: (at person13 city8)
   added: (in person13 plane1)
   goals met: 9 of 17
37. (fly plane1 city8 city10 fl1 fl0)
   deleted: (at plane1 city8) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 9 of 17
38. (board person6 plane1 city10)
   deleted: (at person6 city10)
   added: (in person6 plane1)
   goals met: 9 of 17
39. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 17
40. (debark person4 plane1 city10)
   deleted: (in person4 plane1)
   added: (at person4 city10)
   goals met: 10 of 17
41. (board person16 plane1 city10)
   deleted: (at person16 city10)
   added: (in person16 plane1)
   goals met: 10 of 17
42. (debark person13 plane1 city10)
   deleted: (in person13 plane1)
   added: (at person13 city10)
   goals met: 11 of 17
43. (fly plane1 city10 city11 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 11 of 17
44. (refuel plane1 city11 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 17
45. (debark person6 plane1 city11)
   deleted: (in person6 plane1)
   added: (at person6 city11)
   goals met: 12 of 17
46. (fly plane1 city11 city4 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 12 of 17
47. (debark person16 plane1 city4)
   deleted: (in person16 plane1)
   added: (at person16 city4)
   goals met: 13 of 17
48. (fly plane2 city7 city3 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 13 of 17
49. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 17
50. (debark person11 plane2 city3)
   deleted: (in person11 plane2)
   added: (at person11 city3)
   goals met: 14 of 17
51. (fly plane2 city3 city5 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 14 of 17
52. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 17
53. (debark person8 plane2 city5)
   deleted: (in person8 plane2)
   added: (at person8 city5)
   goals met: 15 of 17
54. (fly plane2 city5 city1 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 16 of 17
55. (zoom plane3 city5 city9 fl2 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl2)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 16 of 17
56. (board person1 plane3 city9)
   deleted: (at person1 city9)
   added: (in person1 plane3)
   goals met: 16 of 17
57. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 16 of 17
58. (fly plane3 city9 city3 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 16 of 17
59. (debark person1 plane3 city3)
   deleted: (in person1 plane3)
   added: (at person1 city3)
   goals met: 17 of 17
